{
  "letter": "a",
  "terms": [
    {
      "term": "AE — Account Executives",
      "meaning": "This is the person that is responsible for the relationship between two organizations, generally a lender and broker. He/she works as a liaison to ensure the relationship grows and flourishes. This person is the first point of contact for issues and concerns as the account executive knows the hierarchy of his/her organization and can escalate issues/concerns appropriately."
    },
    {
      "term": "ALTA — American Land Title Association",
      "meaning": "A national trade association made up of members who search, review, and insure land titles to protect home buyers and mortgage lenders who invest in real estate. Alta members range from attorneys to lenders to builders and everything in between. Their mission is to facilitate the transfer of real estate by acting in an efficient and experienced manner."
    },
    {
      "term": "AMC — Appraisal Management Company",
      "meaning": "An Appraisal Management Company (AMC) works with a pool of independent appraisers to facilitate appraisals in the mortgage industry. It is important to use an AMC in mortgage lending because it sets the appraiser away from the lender, broker and borrower. AMC organizations work using USPAP (Uniform Standards of Professional Appraisals Practices) guidelines so that appraisals are honest and true."
    },
    {
      "term": "Amortization",
      "meaning": "Amortization means paying off a loan with regular payments over time, so that the amount you owe decreases with each payment. Most home loans amortize, but some mortgage loans do not fully amortize, meaning that you would still owe money after making all of your payments.<br /><br />Some home loans allow payments that cover only the amount of interest due, or an amount less than the interest due. If payments are less than the amount of interest due each month, the mortgage balance will grow rather than decrease. This is called negative amortization. Other loan programs that do not amortize fully during the loan may require a large, lump sum “balloon” payment at the end of the loan term. Be sure you know what type of loan you are getting."
    },
    {
      "term": "Amount Financed",
      "meaning": "The amount of money you are borrowing from the lender, minus most of the upfront fees the lender is charging you"
    },
    {
      "term": "Annual Income",
      "meaning": "A factor in a mortgage loan application and generally refers to your total earned, pre-tax income over a year. Annual income may include income from full-time or part-time work, self-employment, tips, commissions, overtime, bonuses, or other sources.  A lender will use information about your annual income and your existing monthly debts to determine if you have the ability to repay the loan.<br /><br />Whether a lender will rely upon a specific income source or amount when considering you for a loan will often depend upon whether you can reasonably expect the income to continue."
    },
    {
      "term": "APP — Application (1003)",
      "meaning": "The standard application form is the Uniform Residential Loan Application or Form 1003 (pronounced 'ten o three'). This form provides all the information necessary to determine if an individual can qualify for a loan. It includes information pertaining to the type of mortgage the borrower would like, the property, the borrower, such as, date of birth, social security number, employment history, monthly income and expenses, and assets and liabilities. Typically this form is filled out on the borrowers behalf by a loan officer using information provided by the borrowers. It is then reviewed by the borrowers and then signed by both the loan officer and borrowers."
    },
    {
      "term": "APR — Annual Percentage Rate",
      "meaning": "The amount a loan will cost the borrower over one year expressed in a percentage. The APR takes into account not only the interest rate but points, and flat dollar charges by the lender as well. This does not include payments to third parties. APR's can vary dependent on current interest rates, the borrowers credit history, and the length of the term. It is important to understand that the APR is not the note rate."
    },
    {
      "term": "Appraisal",
      "meaning": "Mortgage appraisals help determine the fair market value of a property by comparing it to nearby homes that have sold recently. An appraisal is a written document that shows an opinion of how much a property is worth. The appraisal gives you useful information about the property. It describes what makes it valuable and may show how it compares to other properties in the neighborhood. An appraisal is an independent assessment of the value of the property.<br /><br />The VA appraisal also aims to help ensure veterans are purchasing homes that are safe, structurally sound and sanitary. To that end, VA appraisers also look at a broad range of property condition guidelines, known as the Minimum Property Requirements. Lenders can also have their own property condition guidelines.<br /><br />The VA appraisal is not as in-depth as a home inspection and should not be considered a substitute for one. A home inspection is also recommended, as it can provide a more thorough look at a property’s structural integrity and major systems."
    },
    {
      "term": "Appraisal Fee",
      "meaning": "The cost of a home appraisal of a house you plan to buy or already own. Home appraisals provide an independent assessment of the value of the property. In most cases, the selection of the appraiser and any associated costs is up to your lender."
    },
    {
      "term": "ARES — American Real Estate Society",
      "meaning": "ARES is a global organization of real estate leaders. They aim to foster communication within the business and encourage research and education in real estate. Since their organization in 1985 they have developed several estate journals and a yearly summit that features hundreds of research presentations, panels sessions, doctoral seminar, and 'critical issues' seminar. ARES has also aided in the organization of seven real estate 'sister' societies."
    },
    {
      "term": "ARM — Adjustable Rate Mortgage ",
      "meaning": "A type of mortgage that starts with a fixed interest rate but after a designated amount of time, which can range from 1 month to more than 5 years, the interest rate is adjusted. Most ARMs are adjusted every 6 months to 1 year. The time frame between rate changes is call the adjustment period. Such mortgages often start out with lower interest rates than traditional, fixed rate, loans. Whether or not the rate changes and by how much is dependent on the index an the margin. The index is how much interest is being paid on the loan. If interest rates go up your rates will also go up. on the contrary, if interest rates go down it is possible that your rates could go down. However, not all ARMs adjust downward. Lenders most commonly base their rates on 1-year constant-maturity Treasury securities (CMT), Cost of Funds Index (COFI), or London Interbank offered Rate (LIBOR). The margin is the amount that the lender adds. Some lenders will use your credit report as a measure to influence the Margin percentage. The better your credit the less margin the lender tact's on.<br /><br />There are typically interest rate caps put in place to prevent rates from getting too high. There are two types of interest rate caps, a periodic adjustment cap and a lifetime cap. The periodic adjustment cap limits the percentage that your rate can change per adjustment period. Most often this is a cap of 1-2%. The lifetime cap limits the amount that your interest rate changes over the length of the loan.<br /><br />Like many things in life, not all ARMs are created equal. There are several types of ARM's. There are traditional ARMs that has a short fixed period before the first adjustment period. There are also hybrid arms that have a longer fixed period. Most commonly you will see 3/1 or 5/1 ARMs. This means that the fixed period is 3 or 5 years. The 1 signifies that the rate may be adjusted only once every year. There is also an interest-only ARM. This allows you to pay only the interest for a specified number of year. After which time payments will increase regardless of interest rates. A payment-option ARM allows you to chose one of several payment options. These options include; traditional principle and interest payments, interest only payments, and minimum payments."
    },
    {
      "term": "ASA — American Society of Appraisers",
      "meaning": "What once was The American Society of Technical Appraisers (ASTA) and The Technical Valuation Society (TVS) merged in 1852 to become the American Society of Appraisers. ASA is an organization of accredited appraisers, from a large array of disciplines, who aim to promote trust of the appraisal process and its professionals among the public."
    },
    {
      "term": "ASHI — American Society of Home Inspectors",
      "meaning": "ASHI was established in 1976 by a group of home inspectors in order to encourage awareness and professionalism within the field. ASHI works to set rigorous home inspection standards and to promote continued education among it's members."
    },
    {
      "term": "ATR — Ability To Repay",
      "meaning": "Ability to Repay is a standard implemented in 2010 by the Consumer financial Protection Bureau as part of the Dodd-Frank Act. Before extending a loan, lenders must make a reasonable determination as to whether the borrower will have a reasonable ability to repay the debt within the terms of the loan. This determination is based off of eight factors; the borrowers current income and assets, employment status, Monthly payment of mortgage obligations, monthly payment on subsequent loans, current debt obligations, Debt-to-income ratio, and the expected payment of the covered transaction. This standard was put into place to help minimize the number of foreclosures. Lenders cannot loan to borrowers that do not have the financial capacity to repay. If a loan meets the afore mentioned standards it is considered a qualified mortgage."
    },
    {
      "term": "AUS — Automated Underwriting System",
      "meaning": "Mortgage lenders often use a computer system to help immediately assess a borrower's suitability for a home loan. These automated underwriting systems evaluate a borrower's credit, finances and more. Getting approval from one of these systems can help veterans move through the loan process faster and with more flexible requirements. Unlike the USDA loan program, the VA loan program does not currently have its own automated underwriting system."
    },
    {
      "term": "Automatic Payment",
      "meaning": "Automatic payments allow you to set up recurring mortgage payments through your bank. Automatic payments can be a convenient way to make sure that you make your payments on time."
    },
    {
      "term": "AVM — Automated Valuation Model",
      "meaning": "The use of mathematical modeling to value properties by comparing the values of similar properties in the same area at the same point in time. The AVM can be faulty in that it doesn't take into account the condition of the property and assumes it is comparable to others in the area. This can magnify the value of a sub-par property or undervalue a superior property. AVMs are sometimes used by lenders instead of traditional appraisals. AVMs can also be useful to consumers as it can give a rough estimate to what your home is worth when looking at purchasing a new property."
    }
  ]
}
