{
  "letter": "e",
  "terms": [
    {
      "term": "Earnest Money",
      "meaning": "This good-faith deposit is typically made as a buyer gets under contract and shows sellers they're serious about completing the purchase. There's no set amount for an earnest money deposit, and real estate agents are a good guide for what's common in a given market and price range. These funds are often held by a real estate brokerage or title company and can be put toward a down payment or closing costs.<br /><br />The purchase contract will stipulate how the earnest money can be forfeited or refunded. VA buyers have an additional protection known as the VA Amendment to Contract, which allows buyers to keep their earnest money if they walk away from a deal because of a low appraisal."
    },
    {
      "term": "EEM — Energy Efficient Mortgage",
      "meaning": "This specialized mortgage allows qualified veterans to borrow additional money to make energy-efficient improvements to a home they're purchasing or refinancing. With a VA Energy Efficient Mortgage, veterans can typically add up to $6,000 to the loan amount provided they can verify the cost of improvements or prove the efficiencies will result in savings.<br /><br />These improvements typically need to be considered permanent to the property, and items like Energy Star appliances, air conditioning units and new roofs are not acceptable. Guidelines and policies regarding EEMs can vary by lender."
    },
    {
      "term": "Equity",
      "meaning": "The amount your property is currently worth minus the amount of any existing mortgage on your property."
    },
    {
      "term": "Escrow",
      "meaning": "An escrow account is set up by your mortgage lender to pay certain property-related expenses, like property taxes and homeowner’s insurance. A portion of your monthly payment goes into the account.  If your mortgage doesn’t have an escrow account, you pay the property-related expenses directly."
    },
    {
      "term": "Entitlement",
      "meaning": "The VA uses the word to mean the amount of money it will guarantee on a given loan. VA loan entitlement helps buyers determine how much of a down payment will be necessary, if any. There are two layers of entitlement: A basic level of $36,000, with a secondary or second tier that varies depending on the current VA loan limits.<br /><br />Borrowers with their full VA loan entitlement can borrow as much as a lender will lend, all without needing to make a down payment.<br /><br />Veterans with active VA loans and even those who've lost a VA loan to foreclosure can often look to purchase again using that second tier of entitlement. Entitlement isn't clearly reflected or explained on the Certificate of Eligibility, and a trusted lender can help you assess your entitlement situation and what might be possible."
    }
  ]
}
