{
  "letter": "f",
  "terms": [
    {
      "term": "FF — VA Funding Fee",
      "meaning": "A one time fee paid to the VA for the purchase of a loan. The amount of the fee is a percentage dependent on the type of loan, your military category, whether there is a down payment, and if you have uses your eligibility in the past. Those who collect disability from the VA are exempt from the funding fee. The larger the down-payment the smaller the funding fee. The funding fee is also larger after the first use on both new purchases and cash-out refinances. The funding fee for an Interest Rate Reduction Refinance Loan the funding fee is a constant regardless of whether it is the first use or any additional use. The funding fee is typically rolled into the loan. The funding fee is paid to the VA loan so that the benefits, like no down-payment, are available to veterans in the future."
    },
    {
      "term": "FICO Score",
      "meaning": "The most widely used credit score. The credit score is based solely off consumer credit reports. Scores range from 300-850. It is calculated by a mathematical equation that evaluates different types of information taken from your credit report. By comparing your credit history to credit patterns it can estimate your future level of credit risk."
    },
    {
      "term": "Float",
      "meaning": "Once VA buyers get under contract, they need to decide whether to lock their interest rate in place or float, meaning they will wait to see if VA mortgage rates go down as their loan closing nears. Prospective buyers can't typically lock their rate until they're under contract to purchase a home. Your loan officer can help you evaluate the pros and cons of locking. Every buyer's situation is different, and some have more tolerance for risk than others."
    },
    {
      "term": "Forbearance",
      "meaning": "Forbearance is when your servicer allows you temporarily to pay your mortgage at a lower rate or temporarily to stop paying your mortgage. Your servicer may grant you forbearance if, for example, you recently lost your job, suffered from a disaster, or from an illness or injury that increased your health care costs. Forbearance is a type of loss mitigation.<br /><br />Depending on the kind of loan you have, there may be different forbearance options. You must contact your loan servicer to request forbearance. Remember that you will have to make up these missed or reduced payments when your forbearance period is over."
    },
    {
      "term": "Force-Placed Insurance",
      "meaning": "Your servicer may require force-placed insurance when you do not have your own insurance policy or if your own policy doesn’t meet your servicer’s requirements. Force-placed insurance usually protects only the lender, not you. The servicer will charge you for the insurance. Force-placed insurance is usually more expensive than finding an insurance policy yourself."
    },
    {
      "term": "Foreclosure",
      "meaning": "This basically means the lender takes back the home because you failed to keep up with mortgage payments. Some states require foreclosures to go through the court system, while others do not. There are multiple forms and offshoots of foreclosure, including a deed-in-lieu of foreclosure and a short sale. There are restrictions on foreclosures against active duty service members through the Servicemembers Civil Relief Act (SCRA).<br /><br />Foreclosure can hurt your credit score, and you'll typically need to be two years removed from a foreclosure claim in order to secure a VA loan."
    },
    {
      "term": "FHA — Federal Housing Administration",
      "meaning": "A government agency that is responsible for setting standards for construction and underwriting. The FHA guarantees mortgages that require only a small down payment of 3.5%. The requirements for FHA loans are less stringent and more flexible than conventional home loans. In exchange for a low down payment the borrower must pay a mortgage insurance premium each month. The minimum credit score to be approved for an FHA loan is 580. However, if you have a credit score between 500-579 you can still be approved but only for 90% Loan-to-Value."
    },
    {
      "term": "FHA Funding Fee",
      "meaning": "The Federal Housing Administration (FHA) requires an FHA funding fee and a monthly insurance premium (MIP) for most of its single-family programs. This upfront mortgage insurance premium is sometimes called an upfront mortgage insurance premium (UFMIP)."
    },
    {
      "term": "FHA Loan",
      "meaning": "FHA loans are loans from private lenders that are regulated and insured by the Federal Housing Administration (FHA). FHA loans differ from conventional loans because they allow for lower credit scores and down payments as low as 3.5 percent of the total loan amount. Maximum loan amounts vary by county."
    },
    {
      "term": "FHA Mortgage Limits",
      "meaning": "The dollar amount limits for qualifying mortgages that the FHA will insure as part of its single-family home mortgage program. These limits are based upon location and they may be revised each year."
    },
    {
      "term": "Finance Charge",
      "meaning": "The total amount of interest and loan charges you would pay over the entire life of the mortgage loan"
    },
    {
      "term": "FMV — Fair Market Value",
      "meaning": "The amount that the property would sell for if put up for sale. This is based on the location, and existence of comparable property. This does not take into account preferences or circumstances."
    },
    {
      "term": "FNMA — Federal National Mortgage Association — aka Fannie Mae",
      "meaning": "More commonly referred to as Fannie Mae. FNMA is a government-sponsored organization created in 1938 in order to enhance the liquidity of lender's money. FNMA guarantee and purchases FHA and VA mortgages from smaller lenders. This allows the lenders to have less money tied up in mortgages and allows them to loan to more borrowers. The Federal Home Loan Mortgage Corporation (FHLMC) or Freddie Mac shares the same objective. However, FHLMC buys conventional mortgages from lenders."
    },
    {
      "term": "The Federal Home Loan Mortgage Corporation — aka Freddie Mac",
      "meaning": "The Federal Home Loan Mortgage Corporation (Freddie Mac) is a private corporation founded by Congress. Its mission is to promote stability and affordability in the housing market by purchasing mortgages from banks and other loan makers. The corporation is currently under conservatorship, under the direction of the Federal Housing Finance Agency (FHFA)."
    },
    {
      "term": "FPM — Flexible-Payment Mortgage",
      "meaning": "A flexible-payment mortgage is a type of ARM that allows the borrower to choose from a variety of payment options. These Payment options are a traditional 30 or 15 year amortizing payment plan, interest only, or minimum payments. The interest only loan allows the borrower to pay the interest that is incurred each month for the first 5 or so years. After which the payments must be larger enough to pay off the principle within the term of the loan. the minimum payments plan allows borrowers to pay the same payment that they had during the fixed period of the ARM even after their rate has increased. This can often cause the mortgage to have a higher balance than before payments initialized."
    },
    {
      "term": "FRM — Fixed Rate Mortgage",
      "meaning": "A type of mortgage where the interest rate stays the same for the life of the loan. This is the most common type of mortgage in the U.S. Fixed rate mortgages generally have 15 or 30 year terms."
    },
    {
      "term": "FSBO — For Sale By Owner",
      "meaning": "A FSBO (pronounced fizz boe) is a property that is 'For Sale By Owner'. In other words, the home owner of the property that is for sale has listed the property for sale solely without any representation. This is commonly done because the home owner does not want to pay out a real estate commission with a listing agent whose commission ranges between 2% to 3% of the purchase price. Note that even if a house is a FSBO, that as a buyer you may have representation and make a real estate purchase contract where the seller is responsible for your real estate agent commission. This is common because a transaction traditionally goes smoother when there is a licensed real estate professional involved."
    },
    {
      "term": "FTHB — First-Time Home Buyer",
      "meaning": "An individual that has not previously had ownership of a house. an individual who has not owned a home in the last three years can also be considered a first time home buyer."
    },
    {
      "term": "First-Time Home Buyer — FTHB — Loan Programs",
      "meaning": "First-time home buyers (FTHB) may use a number of different types of loan programs to purchase their first home. Popular FTHB loans include programs offered by FHA, VA, USDA, Fannie Mae, and Freddie Mac with low down payments. Some programs define a FTHB as someone who hasn’t purchased a home in three years or more."
    }
  ]
}
