{
  "letter": "h",
  "terms": [
    {
      "term": "HEL — Home Equity Loan",
      "meaning": "A type of loan that allows borrowers to use the equity of their home as collateral. Home Equity loans, often referred to as a second mortgage are often used to pay off other debts or repair/remodel the home. A HEL is a lump sum loan most commonly with a fixed interest rate."
    },
    {
      "term": "HELOC — Home Equity Line of Credit",
      "meaning": "A revolving line of credit with an adjustable interest rate. The borrowers home is used as collateral for HELOC. It is the up to the borrower to determine when and how often. However, there is usually an initial limit set by the lender. This may also be referred to as a second mortgage."
    },
    {
      "term": "Higher-Priced Mortgage Loan",
      "meaning": "In general, a higher-priced mortgage loan is one with an annual percentage rate, or APR, higher than a benchmark rate called the Average Prime Offer Rate."
    },
    {
      "term": "HOA — Homeowner Association",
      "meaning": "A homeowner association is an corporation formed by a real estate developer. it allows the developer to still have a hand in the governing of the subdivision without any financial obligation. membership to the association is usually required when purchasing a home that has an HOA. The role of the HOA has the authority it implement rule and standards within the subdivision."
    },
    {
      "term": "HOA dues",
      "meaning": "If you’re interested in buying a condo, co-op, or a home in a planned subdivision or other organized community with shared services, you usually have to pay condo fees or Homeowners’ Association (HOA) dues. These fees vary widely. Condo or HOA fees are usually paid separately from your monthly mortgage payment. If you do not pay these fees, you can face debt collection efforts by the homeowner’s association and even foreclosure."
    },
    {
      "term": "HOI — Homeowners Insurance",
      "meaning": "Homeowners insurance is a multiline property insurance policy for private residence. The HOI covers both liability insurance, if someone were to be injured on your property, and homeowners insurance to cover the home from damage. Flood damage is typically excluded in standard homeowners policies but can be purchased independently. The cost of homeowners insurance is often determined by how much it would cost to replace the residence."
    },
    {
      "term": "HUD — Department of Housing and Urban Development",
      "meaning": "The Department of Housing an Urban Development was created in 1965 as a cabinet-level agency. HUD is responsible for enforcing all relative laws as passed by Congress. It is also under their jurisdiction to develop and implement various programs that aide in improving communities throughout the nation, and help to create suitable homes and living environments."
    },
    {
      "term": "HUD1 Settlement Statement",
      "meaning": "The statement that you receive, at closing, detailing all the costs and expenses involved in the obtaining the loan. This includes all closing costs and fees charged by the lender. You receive a HUD-1 if you apply for a reverse mortgage or if you applied for a mortgage on or before October 3, 2015."
    },
    {
      "term": "Hybrid Adjustable-Rate Mortgage (ARM)",
      "meaning": "This combines elements of both fixed- and adjustable-rate mortgages, which is why it's called a 'hybrid.' A hybrid ARM will start with a fixed interest rate for a set number of years, often three or five, before reverting to an adjustable-rate loan for the remainder of the term. From there, the interest rate can increase up to 1 percentage point per year, with a lifetime cap of 5 percentage points."
    },
    {
      "term": "HVAC — Heating, Ventilation and Air Conditioning",
      "meaning": "This is a system used to control indoor air temperatures and conditions. HVAC is important in the construction of buildings in order to maintain a comfortable and sustainable working and living environment."
    }
  ]
}
