{
  "letter": "m",
  "terms": [
    {
      "term": "Manual Underwriting",
      "meaning": "Lenders will typically input a prospective borrower's information into an automated underwriting system that can generate an immediate green light, indicating there are no major red flags and the veteran can proceed to the next step. In some cases, loan files do not meet this initial underwriting approval, at which point they might be subject to what's known as manual underwriting.<br /><br />Manual underwrites usually mean tougher lending requirements and a closer look from underwriters earlier in the process. But they're also not uncommon, and plenty of borrowers who encounter manual underwriting go on to close on their loan."
    },
    {
      "term": "Margin",
      "meaning": "The number of percentage points added to the index by the mortgage lender to set your interest rate on an adjustable-rate mortgage (ARM) after the initial rate period ends. The margin is set in your loan agreement and won't change after closing. The margin amount depends on the particular lender and loan."
    },
    {
      "term": "MBA — Mortgage Bankers Association of America",
      "meaning": "A national organization the represents the real estate finance industry in its entirety. MBA aims to create sustainable future for the industry and all it's participants."
    },
    {
      "term": "MBS — Mortgage Backed Security",
      "meaning": "A collection of mortgages sold to by the lender to individuals that the lender later sells to a larger investment bank or government-sponsored enterprise such as Fannie Mae (FNMA) and Freddie Mac. This helps to increase the liquidity of funds available for mortgages."
    },
    {
      "term": "Minimum Property Requirements",
      "meaning": "These are broad health and safety conditions that a property must meet to satisfy the VA. Independent VA appraisers will assess the property in light of the Minimum Property Requirements during their time at the home. Any repair issues noted by the appraiser will often need to be addressed before the loan can close. Home sellers and even VA buyers can pay for repairs to keep the loan moving forward.<br /><br />Generally, the VA wants veterans purchasing homes that are move-in ready, but an appraisal that turns up MPR issues does not mean your purchase is automatically in jeopardy. Repairs are often negotiated with sellers, but every situation is different."
    },
    {
      "term": "MIP — Mortgage Insurance Premium",
      "meaning": "MIP is insurance paid for by the borrower of FHA loans. It is similar to PMI, in that it is a safety measure put into place to protect the lender if the borrower defaults. Borrowers are charged a 1% upfront MIP as well as an annual MIP of around 1.15%. 1/12 of the annual fee is paid each month and deposited into an escrow account for the lender to use when the payment is due."
    },
    {
      "term": "MLO — Mortgage Loan Originator",
      "meaning": "A MLO is a mortgage loan originator (also known as a loan officer). The MLO assists a lender or broker in finding borrowers, taking applications, selling products and advising them on mortgage products. A MLO that is employed by a non depository institution is required to take licensing exams and continuing education to keep their license active."
    },
    {
      "term": "MLS — Multiple Listing Service",
      "meaning": "An online database available to brokers and real estate agents that has many available for sale properties. This enables real estate agents to assist their clients in finding homes as it gives them accessibility to a large variety of home in different price ranges, neighborhoods, and features."
    },
    {
      "term": "Monthly Expenses",
      "meaning": "Hw much you spend every month. It can include, but is not limited to, recurring obligations like rent or mortgage payment, utilities, car payments, child support payments, and insurance payments, as well as essentials like food. Most of these obligations will have a fixed due date."
    },
    {
      "term": "Mortgage",
      "meaning": "An agreement between you and a lender that allows you to borrow money to purchase or refinance a home and gives the lender the right to take your property if you fail to repay the money you've borrowed."
    },
    {
      "term": "Mortgage Insurance",
      "meaning": "Mortgage insurance protects the lender if you fall behind on your payments. Mortgage insurance is typically required if your down payment is less than 20 percent of the property value. Mortgage insurance also is typically required on FHA and USDA loans. However, if you have a conventional loan and your down payment is less than 20 percent, you will most likely have private mortgage insurance (PMI)."
    },
    {
      "term": "Mortgage Term",
      "meaning": "The term of your mortgage loan is how long you have to repay the loan. For most types of homes, mortgage terms are typically 15, 20 or 30 years."
    },
    {
      "term": "MPC — Master Planned Community",
      "meaning": "A large scale community that has is carefully planned far before its development begins. Typically MPCs are constructed in areas that have no previous development. These communities tend to offer a range of housing options in terms of price and style. Generally there is a mix of residential and non residential areas."
    }
  ]
}
