{
  "letter": "p",
  "terms": [
    {
      "term": "PACE Financing",
      "meaning": "PACE financing provides a way to fund energy efficiency home improvements."
    },
    {
      "term": "Payoff Amount",
      "meaning": "How much you will actually have to pay to satisfy the terms of your mortgage loan and completely pay off your debt. Your payoff amount is different from your current balance. Your current balance might not reflect how much you actually have to pay to completely satisfy the loan. Your payoff amount also includes the payment of any interest you owe through the day you intend to pay off your loan. The payoff amount may also include other fees you have incurred and have not yet paid."
    },
    {
      "term": "PCS Orders",
      "meaning": "Active duty servicemembers may be given permanent change of station (PCS) orders. PCS orders are an official relocation of a servicemember (and any family living with them) to a different duty location.  If the servicemember owns a home, they may choose to sell it. If the servicemember owes more on the home than the home is worth, they may have trouble selling their home. Some servicers offer programs to allow servicemembers to sell their home and not have to pay back the rest of the loan balance. Visit <a href='https://www.consumerfinance.gov/consumer-tools/military-financial-lifecycle/' target='_blank' rel='noreferrer noopener'>servicemember resources</a> for more information."
    },
    {
      "term": "Permanent Buydown",
      "meaning": "Veterans can pay money upfront to essentially purchase a lower interest rate for the life of the loan. You'll pay in the form of what are called points, where 1 point is equal to 1 percent of the loan amount. The VA allows veterans to pay reasonable points to buy down their rate, typically not to exceed 2 points."
    },
    {
      "term": "Principal",
      "meaning": "the amount of a mortgage loan that you have to pay back. Your monthly payment includes a portion of that principal. When a payment on the principal is made, the borrower owes less, and will pay less interest based upon a lower loan size."
    },
    {
      "term": "PI — Principal and Interest",
      "meaning": "Principal is the outstanding balance of the loan. Interest is the amount, expressed in an annual percentage, that is charged for financing a loan. These two components of PITI make up the majority of your mortgage payment."
    },
    {
      "term": "PITI — Principal, Interest, Taxes and Insurance",
      "meaning": "The components of the total monthly housing expense. Principle is the amount of the loan that is yet to be paid. Interest is the cost of financing a loan, often expressed as an annual percentage. Taxes are 1/12 of your yearly tax payment each month that is put into an escrow account to be paid by the lender when due. Insurance is the your MIP or PMI that is also put into an escrow account to be paid at a later time."
    },
    {
      "term": "Power of Attorney",
      "meaning": "A surrogate with power of attorney can sign contracts and other documents on behalf of an absent service member. Many lenders require a unique power of attorney document. Talk with lenders about their guidelines given your specific situation."
    },
    {
      "term": "PMI — Private Mortgage Insurance",
      "meaning": "Private Mortgage Insurance (PMI) is paid by the borrower to protect the lender if the borrower were to default on the loan. PMI is typically required for loans with a down-payment smaller than 20% except with VA and FHA loans. Insurance rates can range from .5%-6% each year. The percent of the premium is influenced by the LTV, credit score, and whether the loan has a fixed or variable rate. Your monthly PMI payment is put into an escrow account. Your lender then uses this account to pay the yearly insurance premium when due. The Homeowners Protection Act of 1998 requires lenders to automatically discontinue PMI once you have 22% equity in your home."
    },
    {
      "term": "PR — Primary Residence",
      "meaning": "A primary residence is a property an individual calls home. I f an individual occupies multiple residences throughout the year the property in which the individual spends the most time is considered the primary residence."
    },
    {
      "term": "PR — Principal Reduction",
      "meaning": "Principal reduction is a program offered by Fannie Mae and Freddie Mac in order to assist qualified borrower with debt relief. Principal reduction allows a portion, usually no larger than $500 be removed from the remaining principal of a loan. This is generally used in order to help prevent foreclosures. In order to qualify for principle reduction a borrower must be at least 61 days behind of mortgage payments, not currently be in bankruptcy of legal proceedings, not be engaged in loanmodification, home must be owner occupied, have an income verificationthat documents no more than 40% housing costs compared to gross income."
    },
    {
      "term": "Preapproval",
      "meaning": "This is a more serious step than prequalification and involves a lender verifying key information about your debts and income. VA loan preapproval gives you a clear sense of your buying power, and it shows real estate agents and home sellers you're a strong and serious homebuying candidate. Getting preapproved doesn't obligate you to any particular lender or to purchasing a home, and it is not a guarantee of financing. But it is the first big milestone of the VA purchasing process."
    },
    {
      "term": "Property Taxes",
      "meaning": "Taxes charged by local jurisdictions, typically at the county level, based upon the value of the property being taxed. Often, property taxes are collected within the homeowner’s monthly mortgage payment, and then paid to the relevant jurisdiction one or more times each year. This is called an escrow account. If the loan does not have an escrow account, then the homeowner will pay the property taxes directly."
    },
    {
      "term": "Prequalification",
      "meaning": "This introductory step is often mostly just a conversation with a loan specialist about your service history, your employment and finances, and your homebuying goals that ends with a look at your mortgage credit scores. Benchmarks can vary by lender, loan type and other factors, but borrowers will usually need to meet a minimum credit score requirement to move on to getting preapproved for a loan, which is more involved and important milestone.<br /><br />VA loan prequalification doesn't usually involve much verification of information beyond your credit score, and so it holds little weight with home sellers and real estate agents, who are looking for buyers with loan preapproval."
    },
    {
      "term": "Prepaid Interest Charges",
      "meaning": "Prepaid interest charges are charges due at closing for any daily interest that accrues on your loan between the date you close on your mortgage loan and the period covered by your first monthly mortgage payment."
    },
    {
      "term": "Prepaid Penalty",
      "meaning": "A fee that some lenders charge if you pay off all or part of your mortgage early. If you have a prepayment penalty, you would have agreed to this when you closed on your home. Not all mortgages have a prepayment penalty."
    },
    {
      "term": "Prime",
      "meaning": "This essentially means borrowers or loans at or above an accepted credit standard, typically around 640. Some loans and borrowers beneath that are considered greater risks and classified as subprime."
    },
    {
      "term": "Processing",
      "meaning": "Processing takes place after a loan officer receives and Compiles your file of information, such as, the credit report, appraisal, verification of employment,etc. The loan processor will take this information and prepare it to be submitted to underwriting. During processing they check that they have all the required documentation and may request additional information required before it can be submitted to underwriting."
    },
    {
      "term": "Purchase Price",
      "meaning": "The amount agreed to by the buyer and seller to be paid to the seller to purchase the home."
    },
    {
      "term": "PTD — Prior To Doc",
      "meaning": "Prior to Doc (PTD) or sometimes referred to as Prior to Documents are documents the underwriter requires before the loan documents can be ordered. They will communicate this with your loan officer who will work with you to make sure the documents are all in order for underwriting. Some examples of documents that might be requested are additional income or employment verification, appraisals, etc. It is important to work closely with your loan officer to get these in before your rate lock expires."
    },
    {
      "term": "PTF — Prior to Funding",
      "meaning": "Prior to Funding refers to conditions that come up after a underwriter reviews the loan. These conditions must be met before the loan will be funded by the lender."
    }
  ]
}
