{
  "letter": "r",
  "terms": [
    {
      "term": "Rate Lock",
      "meaning": "A binding commitment that locks a borrower to a specific interest rate. Borrowers can typically lock their interest rate as soon as they sign a purchase agreement and up to five days before the loan closing. Rate locks are good for specific blocks of time. The most common lock periods are for 15 days, 30 days, 45 days and 60 days.<br /><br />Some lenders may charge a fee to lock a rate."
    },
    {
      "term": "Rate Cap",
      "meaning": "Some lenders include a rate cap with their rate locks. These caps give lenders the ability to give borrowers a slightly higher interest rate if rates rise considerably before closing.<br /><br />Rate caps also come into play with VA adjustable-rate mortgages (ARMs). These caps limit how often and how much the rate can change on an ARM over time."
    },
    {
      "term": "Realtor",
      "meaning": "A real estate agent who is a member of the National Association of Realtors."
    },
    {
      "term": "REC — Real Estate Commission",
      "meaning": "A department or agency that oversees real estate license of real estate agents an brokers. Each state has it's own commission. License qualifications and requirements vary from state to state."
    },
    {
      "term": "Refinance",
      "meaning": "A loan that replaces an existing mortgage to finance at a lower interest rate and/or take out cash. The most common reason for refinancing is to take advantage of interest rates lower than when the loan was originally made. The VA has two primary refinance options.<br /><br />One is the Interest Rate Reduction Refinance Loan (IRRRL), which is available only to current VA loan holders. Veterans can use this to refinance into a lower-rate mortgage or out of an adjustable-rate loan. The other is the VA Cash-Out Refinance. This allows qualified homeowners to refinance and extract cash from their equity, regardless of whether their current loan is backed by the VA."
    },
    {
      "term": "REO — Real Estate Owned",
      "meaning": "Property that is owned by a bank or financial institution. Result of defaulted loans leading to foreclosure."
    },
    {
      "term": "Repayment Plan",
      "meaning": "A repayment plan is a structured way to make up your missed mortgage loan payments over a certain period of time. This is a type of loss mitigation. If you have trouble making your mortgage payments, your lender or servicer may allow you to enter into a repayment plan. Before entering into a repayment plan, make sure you understand the requirements of the plan and whether you will be able to make the new payments."
    },
    {
      "term": "REPC — Real Estate Purchase Contract",
      "meaning": "A REPC (pronounced REP C) is the Real Estate Purchase Contract. This document outlines the terms and conditions of a purchase of real estate. It lists the buyer(s) and seller(s), agent(s), purchase price, concessions, what comes with the home, deadlines, contingencies and other legal contractual goodies. Some states have adopted template form for a REPC so that buyers, sellers and agents on both sides have an easier time going throughout the transaction without getting lawyers invovled."
    },
    {
      "term": "Reserves",
      "meaning": "Some borrowers might need a set amount of cash reserves in the bank to close on their VA loan. Reserves are often expressed in terms of a certain number of months' worth of mortgage payments. Cash reserves aren't a common requirement for VA loans, but they can also be a compensating factor that strengthens your loan file."
    },
    {
      "term": "Residual Income",
      "meaning": "This is a lending standard unique to VA loans. Residual income is the amount of money a borrower has left over each month after covering all their major monthly debts and obligations. The VA wants to see veterans have a minimum amount residual income, which can vary depending on the size of your family and where in the country you're buying."
    },
    {
      "term": "RESPA — Real Estate Settlement Practices Act",
      "meaning": "A federal law passed in 1974 to protect the borrower and seller by requiring full disclosure of the terms of the transaction at closing. This law was passed because several lenders, title insurance companies, and real estate agents were providing 'kickbacks' to each-other with out disclosing them to borrowers. and example of a kick back is a lender advertising a very low interest rate but requiring borrowers to get title insurance from a specific company with an inflated cost. The title insurance company would the 'kickback' a portion of the fee to the lender.The RESPA prohibits kickbacks and now requires lenders to provide a Good Faith Estimate early on in the application process, with all approximate cost of the loan, and a HUD-1 at closing, disclosing the specifics of the loan and to whom all fees will be paid. RESPA restricted the amount the fees can increase to 10% between the GFE and the HUD-1. RESPA also prohibits any increase in the origination fees."
    },
    {
      "term": "Reverse Mortgage",
      "meaning": "A reverse mortgage allows homeowners age 62 or older to borrow against their home equity. It is called a “reverse” mortgage because, instead of making payments to the lender, you receive money from the lender. The money you receive, and the interest charged on the loan, increases the balance of your loan each month. Most reverse mortgages today are called HECMs, short for Home Equity Conversion Mortgage."
    },
    {
      "term": "Right of Rescission",
      "meaning": "The right of rescission refers to the right of a consumer to cancel certain types of loans. If you are buying a home with a mortgage, you do not have a right to cancel the loan once the closing documents are signed. However, if you are refinancing a mortgage, you have until midnight of the third business day after the transaction to rescind (cancel) the mortgage contract. The three-day clock does not start until you sign the credit contract (usually called the promissory note), you receive a Truth in Lending disclosure form, and you receive two copies of a notice explaining your right to rescind."
    },
    {
      "term": "RM — Relationship Manager",
      "meaning": "A Relationship Manager is responsible for ensuring positive and professional communication between a company and its clients, as well as, a company and businesses that they cooperate with."
    }
  ]
}
