{
  "letter": "s",
  "terms": [
    {
      "term": "SAH — Special Adapted Housing",
      "meaning": "The VA has a few specialized housing grant programs for veterans with disabilities. These grants help qualified veterans to purchase or build an adapted home or to make modifications to an existing home. The two primary programs are the Specially Adapted Housing (SAH) grant and the Special Housing Adaptation (SHA) grant, and maximum funding for these can change every year. Talk with your loan officer if this is something you're interested in exploring."
    },
    {
      "term": "SAR — Staff Appraisal Reviewer",
      "meaning": "A lender's staff appraisal reviewer, or SAR, examines a property's independent VA appraisal and issues the final Notice of Value."
    },
    {
      "term": "Security Interest",
      "meaning": "The security interest is what lets the lender foreclose if you don't pay back the money you borrowed."
    },
    {
      "term": "Second Mortgage",
      "meaning": "A second mortgage or junior lien is a loan you take out using your house as collateral while you still have another loan secured by your house."
    },
    {
      "term": "Second-Tier Entitlement",
      "meaning": "Eligible veterans have two layers of VA loan entitlement, which reflects the government's guaranty on the loan. Veterans have a basic entitlement valued at $36,000, and a second-tier of entitlement that helps boost their zero-down buying power. The amount of this second layer of entitlement can vary depending on where in the country you're buying and your previous history with the VA loan program.<br /><br />Second-tier entitlement is how veterans can have multiple VA loans at the same time or purchase again after losing one to default. Buyers using their second-tier entitlement will need to borrow at least $144,001 to make things work."
    },
    {
      "term": "Secondary Mortgage Market",
      "meaning": "Lenders sell mortgages, often packaged into mortgage-backed securities, in this marketplace. Private investors and government-sponsored enterprises like Fannie Mae and Freddie Mac buy loans in the secondary market."
    },
    {
      "term": "Seller Concessions",
      "meaning": "The VA allows sellers to pay all of a buyer's loan-related closing costs and up to 4 percent in what are known as seller concessions. Concessions can cover a wide range of expenses and fees, including paying the portion of a buyer's property taxes and homeowners insurance due at closing; paying off a buyer's collections and judgments; and more. Home sellers are not required to anything on behalf of a VA buyer, but every purchase and negotiation is different."
    },
    {
      "term": "Seller Financing",
      "meaning": "Seller financing is a loan that the seller of your home makes to you."
    },
    {
      "term": "Servicer",
      "meaning": "Your mortgage servicer is the company that sends you your mortgage statements. Your servicer also handles the day-to-day tasks of managing your loan.<br /><br />Your loan servicer typically processes your loan payments, responds to borrower inquiries, keeps track of principal and interest paid, and manages your escrow account (if you have one). The loan servicer may initiate foreclosure under certain circumstances. Your servicer may or may not be the same company that originally gave you your loan."
    },
    {
      "term": "SFD — Single Family Detached",
      "meaning": "A free-standing residential building intended to be occupied by one family. however, homes with basement or mother-in-law suites may still fall under this distinction."
    },
    {
      "term": "Shared Appreciation Mortgage",
      "meaning": "Under a shared appreciation mortgage, you agree to give your lender a share of any increase in the value of your home."
    },
    {
      "term": "Short Sale",
      "meaning": "A short sale is a sale of your home for less than what you owe on your mortgage. A short sale is an alternative to foreclosure, but because it is a sale, you will have to leave your home. If your lender or servicer agrees to a short sale, you may be able to sell your home to pay off your mortgage, even if the sale price or proceeds turn out to be less than the balance remaining on your mortgage. A short sale is a type of loss mitigation. If you live in a state in which you are responsible for any deficiency, which is the difference between the value of your property and the amount you still owe on your mortgage loan, you will want to ask your lender to waive the deficiency. If the lender waives the deficiency, get the waiver in writing and keep it for your records.<br /><br />A short sale will negatively affect your credit score. Veterans who lose a home to short sale will lose whatever VA loan entitlement they utilized on the property, but they might have little trouble purchasing again using second-tier entitlement. Some lenders will have a waiting period before you can get a loan following a short sale."
    },
    {
      "term": "SP — Subject Property",
      "meaning": "A subject property is the property for which a borrower intends to get a loan. This can be either a new property or an existing property when refinancing."
    },
    {
      "term": "SRP — Service Release Premium",
      "meaning": "The commission that is made by a bank or other financial institution when a mortgage is sold to a secondary mortgage market purchaser, such as, Fannie Mae, or an investment bank. The amount paid is dependent upon the market value of the mortgage note. it is also influenced by the interest rate, loan type, LTV, margin (for ARM loans), and credit score."
    },
    {
      "term": "SS — Social Security",
      "meaning": "Social Security or SS refers to a tax that is paid by workers. This money is then used to pay retirement, disability, and toward the families of an individual who is disabled or deceased."
    },
    {
      "term": "SSA — Social Security Administration",
      "meaning": "The Social Security Administration is a U.S. Federal Agency. Their responsibilities consist of issuing Social Security numbers to citizens and residents, retirement funds, disability, and survivor's benefits. These programs are paid for by Social Security taxes that are taken out of workers paychecks."
    },
    {
      "term": "Streamline",
      "meaning": "A VA Streamline is another name for the Interest Rate Reduction Refinance Loan (IRRRL). The nickname comes because these are designed as a swift, low-paperwork way to get qualified veterans into lower-cost loans or out of adjustable-rate mortgages."
    },
    {
      "term": "Subprime",
      "meaning": "When lenders use the term, they generally mean a loan program for borrowers who do not qualify for a prime loan, often with a higher interest rate. This essentially means borrowers or loans below an accepted credit standard, typically around 620. Subprime borrowers carry greater risks and now have trouble securing financing."
    },
    {
      "term": "Survey",
      "meaning": "A survey is a drawing of your property showing the location of the lot, the house and any other structures, as well as any improvements on the property."
    },
    {
      "term": "SSN — Social Security Number",
      "meaning": "A Social Security number is a 9 digit number given to U.S. citizens as a form of identification. permanent and temporary (working) residents are also given social security numbers. When issued a SSN you are given a card with your name and SSN on it. this card is needed for many things including getting a loan."
    }
  ]
}
