{
  "letter": "v",
  "terms": [
    {
      "term": "VA — Veteran Affairs",
      "meaning": "The VA is a cabinet-level agency that is dedicated to the well-being of U.S. Veterans. There are many benefits offered to veterans through the VA including disability compensation, life insurance, health care, and education opportunities. The VA operates 152 hospitals, 800 outpatient clinics, 126 nursing home care units, and 35 domiciliaries. The VA also guarantees mortgages for veterans. These mortgages do not require a down-payment."
    },
    {
      "term": "VA Loan",
      "meaning": "A VA loan is a loan program offered by the Department of Veterans Affairs (VA) to help servicemembers, veterans, and eligible surviving spouses buy homes.  The VA does not make the loans but sets the rules for who may qualify and the mortgage terms. The VA guarantees a portion of the loan to reduce the risk of loss to the lender. The loans generally are only available for a primary residence."
    },
    {
      "term": "VOD — Verification of Deposit",
      "meaning": "A document prepared by an individuals bank verifying the current balance of all account the individual has. This letter needs to be on official letterhead of the bank. The VOD is just one component of the potential borrowers application."
    },
    {
      "term": "VOE — Verification of Employment",
      "meaning": "Form 1005 is to be filled out by the employer of the borrower to verify employment. Recently VOE is often conducted verbally by the lender prior to closing. VOE must include the applicants date of employment, job title, probability of continued employment, base pay, and total earnings."
    },
    {
      "term": "VVOE — Verbal Verification of Employment",
      "meaning": "The process of confirming a potential borrowers employment via verbal channels. Verification of employment is a mandatory step in the loan application process. The conversation must be documented and include the name and title of the individual confirming the employment, date of call, as well as all other information required with a standard VOE."
    }
  ]
}
